Revit 2027 API
ExporterIFCUtils.ValidateCurveLoops Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<CurveLoop> ValidateCurveLoops(
	IList<CurveLoop> curveLoops,
	XYZ extrDirVec
)
Public Shared Function ValidateCurveLoops (
	curveLoops As IList(Of CurveLoop),
	extrDirVec As XYZ
) As IList(Of CurveLoop)
public:
static IList<CurveLoop^>^ ValidateCurveLoops(
	IList<CurveLoop^>^ curveLoops,
	XYZ^ extrDirVec
)
static member ValidateCurveLoops :
        curveLoops : IList<CurveLoop> *
        extrDirVec : XYZ -> IList<CurveLoop>
Parameters
curveLoops IList<CurveLoop>
extrDirVec XYZ
Return Value
IList<CurveLoop>
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace